{
    "About":"Về tôi",
    "Work":"Công việc",
    "Contact":"Liên hệ",
    "overview":"Tôi là một lập trình viên , chuyên thiết kế giao diện người dùng và ứng dụng trên nền tảng web",
    "about_me":"Tôi là sinh viên năm 3 đang theo học tại trường Đại học Công Nghệ Sài Gòn. Tôi là sinh viên đam mê web lập trình, đặc biệt là phát triển ứng dụng và website.Tôi muốn hiểu thêm, học hỏi và phát triển bản thân trong môi trường thực tế để trở thành một web có sức ảnh hưởng lập trình viên.",
    "introduction":"GIỚI THIỆU",
    "overview_title":"Tổng quan.",
    "so_far":"NHỮNG GÌ TÔI CÓ CHO ĐẾN NAY",
    "work_experience":"Kinh nghiệm làm việc.",
    "my_work":"Công việc của tôi",
    "project":"Dự án.",
    "intro_my_project":"Các dự án sau đây thể hiện kỹ năng và kinh nghiệm của tôi thông qua ví dụ thực tế về công việc của tôi. Mỗi dự án được mô tả ngắn gọn bằng liên kết đến kho mã và các bản demo trực tiếp trong đó. Nó phản ánh của tôi khả năng giải quyết các vấn đề phức tạp, làm việc với các công nghệ khác nhau và quản lý dự án một cách hiệu quả.",
    "I self-study and build website interfaces . This is the first project so there are many mistakes. Only the interface has been built and the purchasing features have not yet been developed":"Tôi tự nghiên cứu và xây dựng giao diện website. Đây là dự án đầu tiên nên còn nhiều sai sót. Mới chỉ xây dựng giao diện còn các  tính năng khác thì chưa phát triển",
    "This is my semester project. I use java to handle the logic and models, and for the interface I use java swing. I use Map to manage keywords with keys and values, my project includes the basic functions of a dictionary application. The function I like most is looking up words with the Levenshtein algorithm to find the closest word when not in the map.":"Đây là dự án học kỳ của tôi. Tôi sử dụng java để xử lý logic và mô hình, còn về giao diện, tôi sử dụng java swing. Tôi sử dụng Map để quản lý từ khóa bằng cặp khóa gồm key và value , dự án của tôi bao gồm các chức năng cơ bản của một ứng dụng từ điển. Chức năng tôi thích nhất là tra cứu từ bằng thuật toán Levenshtein để tìm từ gần nhất khi không có trong từ điển.",
    "I taught myself nodejs and reactjs and learned how to create a complete website. I wrote RestfulAPI, using jwt to authenticate users. Combined react-text-to-speach to develop voice search function and integrated openAi with nlp to train more data for AI model for customers Customers can get more information about the shop. This project has many errors that I have not optimized to increase user experience.":"Tôi đã tự học nodejs và Reacjs và học cách tạo một trang web hoàn chỉnh. Tôi đã viết RestfulAPI, sử dụng jwt để xác thực người dùng.Kết hợp react-text-to-speach để phát triển chức năng tìm kiếm bằng giọng nói và tích hợp openAi cùng với nlp để train thêm dữ liệu cho model AI để khách hàng có thể biết thêm thông tin về shop.Dự án này còn nhiều lỗi mà mình chưa tối ưu để tăng trải nghiệm người dùng.",
    "others_say":"Người khác nói gì về tôi",
    "testimonials":"Lời chứng thực.",
    "get_in_touch":"Liên lạc",
    "contact_me":"Liên hệ.",
    "your_name":"Tên của bạn",
    "your_email":"Email của bạn",
    "your_message":"Lời nhắn của bạn",
    "what_name":"Tên bạn là gì?",
    "what_email":"Email của bạn là gì?",
    "what_message":"Bạn muốn nói gì?",
    "send":"Gửi",
    "sending":"Đang gửi...",
    "Developing and maintaining web applications using React.js and other related technologies.":"Phát triển và duy trì các ứng dụng web bằng React.js và các công nghệ liên quan khác.",
    "Collaborating with cross-functional teams including designers, product managers, and other developers to create high-quality products.":"Cộng tác với các nhóm đa chức năng bao gồm nhà thiết kế, quản lý sản phẩm và các nhà phát triển khác để tạo ra các sản phẩm chất lượng cao.",
    "Implementing responsive design and ensuring cross-browser compatibility.":"Triển khai thiết kế đáp ứng và đảm bảo khả năng tương thích giữa nhiều trình duyệt.",
    "Participating in code reviews and providing constructive feedback to other developers.":"Tham gia đánh giá mã và cung cấp phản hồi mang tính xây dựng cho các nhà phát triển khác.",
    "This is my 2nd project using MERN. I wrote restfullAPI for users, posts, reels, messages,.... Implement real-time messaging as well as real-time comments and likes. I store images and videos on cloudinary through multer so I can post multiple photos or one photo for users. For the user interface, I use antd . The project is in the process of being stopped because I'm busy with a lot of work, but will probably continue after a while to complete a complete project.":"Đây là dự án thứ 2 của tôi sử dụng MERN. Tôi đã viết RestfullAPI cho người dùng, bài đăng, cuộn phim, tin nhắn, .... Triển khai tính năng nhắn tin theo thời gian thực cũng như nhận xét và lượt thích theo thời gian thực. Tôi lưu trữ hình ảnh và video trên cloudinary thông qua multer để có thể đăng nhiều ảnh hoặc một ảnh cho người dùng. Đối với giao diện người dùng, tôi sử dụng antd. Dự án đang trong quá trình tạm dừng vì mình bận nhiều việc nhưng chắc sau một thời gian nữa sẽ tiếp tục để hoàn thành một dự án hoàn chỉnh.",
    "I see you work very well and can complete the job requirements.":"Anh thấy em làm việc rất ổn , có thể hoàn thành các yêu cầu của công việc.",
    "I used useContext to practice how it works and understand more about ReactJs useContext hook":"Tôi sử dụng useContext để luyện cách thức hoạt động và hiểu thêm về hook useContext của ReactJs"

}